<?php

return [

    'single' => [

        'associate' => [
            'label' => 'Асоціювати',
        ],

        'attach' => [
            'label' => 'Прикріпити',
        ],

        'cancel' => [
            'label' => 'Скасувати',
        ],

        'clone' => [
            'label' => 'Клонувати',
        ],

        'confirm' => [
            'label' => 'Підтвердити',
        ],

        'create' => [
            'label' => 'Створити',
        ],

        'delete' => [
            'label' => 'Видалити',
        ],

        'detach' => [
            'label' => 'Відкріпити',
        ],

        'dissociate' => [
            'label' => 'Розірвати асоціацію',
        ],

        'edit' => [
            'label' => 'Редагувати',
        ],

        'export' => [
            'label' => 'Експорт',
        ],

        'force_delete' => [
            'label' => 'Видалити назавжди',
        ],

        'import' => [
            'label' => 'Імпорт',
        ],

        'new' => [
            'label' => 'Новий',
        ],

        'refresh' => [
            'label' => 'Оновити',
        ],

        'replicate' => [
            'label' => 'Дублювати',
        ],

        'restore' => [
            'label' => 'Відновити',
        ],

        'save' => [
            'label' => 'Зберегти',
        ],

        'view' => [
            'label' => 'Переглянути',
        ],

    ],

    'multiple' => [

        'attach' => [
            'label' => 'Прикріпити вибрані',
        ],

        'delete' => [
            'label' => 'Видалити вибрані',
        ],

        'detach' => [
            'label' => 'Відкріпити вибрані',
        ],

        'dissociate' => [
            'label' => 'Розірвати асоціацію з вибраними',
        ],

        'export' => [
            'label' => 'Експортувати вибрані',
        ],

        'force_delete' => [
            'label' => 'Видалити вибрані назавжди',
        ],

        'restore' => [
            'label' => 'Відновити вибрані',
        ],

    ],

    'import' => [

        'completed' => [

            'actions' => [

                'download_failed_rows_csv' => [
                    'label' => 'Завантажити інформацію про невдалий рядок|Завантажити інформацію про невдалі рядки',
                ],

            ],

        ],

        'fields' => [

            'file' => [
                'label' => 'Файл',
                'placeholder' => 'Завантажте CSV файл',
            ],

        ],

        'form' => [

            'actions' => [

                'cancel' => [
                    'label' => 'Скасувати',
                ],

                'import' => [
                    'label' => 'Імпорт',
                ],

            ],

        ],

        'modal' => [

            'heading' => 'Імпорт :label',

            'form' => [

                'actions' => [

                    'cancel' => [
                        'label' => 'Скасувати',
                    ],

                    'import' => [
                        'label' => 'Імпорт',
                    ],

                ],

            ],

        ],

        'notifications' => [

            'completed' => [

                'title' => 'Імпорт завершено',

                'actions' => [

                    'download_failed_rows_csv' => [
                        'label' => 'Завантажити інформацію про невдалий рядок|Завантажити інформацію про невдалі рядки',
                    ],

                ],

            ],

            'max_rows' => [
                'title' => 'Завантажений CSV файл занадто великий',
                'body' => 'Ви не можете імпортувати більше 1 рядка одночасно.|Ви не можете імпортувати більше :count рядків одночасно.',
            ],

            'started' => [
                'title' => 'Імпорт розпочато',
                'body' => 'Ваш імпорт розпочався і 1 рядок буде оброблено у фоновому режимі.|Ваш імпорт розпочався і :count рядків будуть оброблені у фоновому режимі.',
            ],

        ],

    ],

    'export' => [

        'fields' => [

            'columns' => [
                'label' => 'Стовпці',
                'form' => [
                    'select_all' => [
                        'label' => 'Вибрати всі',
                    ],
                ],
            ],

        ],

        'modal' => [

            'heading' => 'Експорт :label',

            'form' => [

                'actions' => [

                    'export' => [
                        'label' => 'Експорт',
                    ],

                ],

            ],

        ],

        'notifications' => [

            'completed' => [
                'title' => 'Експорт завершено',
                'body' => 'Ваш експорт завершено і готовий до завантаження.',
                'actions' => [
                    'download' => [
                        'label' => 'Завантажити',
                    ],
                ],
            ],

            'max_rows' => [
                'title' => 'Експорт занадто великий',
                'body' => 'Ви не можете експортувати більше 1 рядка одночасно.|Ви не можете експортувати більше :count рядків одночасно.',
            ],

            'started' => [
                'title' => 'Експорт розпочато',
                'body' => 'Ваш експорт розпочався і 1 рядок буде оброблено у фоновому режимі.|Ваш експорт розпочався і :count рядків будуть оброблені у фоновому режимі.',
            ],

        ],

    ],

    'modals' => [

        'require_confirmation' => [

            'actions' => [

                'cancel' => [
                    'label' => 'Скасувати',
                ],

                'confirm' => [
                    'label' => 'Підтвердити',
                ],

            ],

        ],

    ],

];
